receipts-backend/app/controllers/facts_controller.rb

SELECT "facts".* FROM "facts"
---
    def index
            @facts = Fact.all

INSERT INTO "facts" ("true_content", "receipt_url", "myth_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["true_content", "she is a hero"], ["receipt_url", "fact.com"], ["myth_id", 1], ["created_at", "2020-09-19 23:53:48.822950"], ["updated_at", "2020-09-19 23:53:48.822950"]]
---
    def create
        @fact = @myth.facts.new(fact_params)
        if @fact.save

SELECT "myths".* FROM "myths" WHERE "myths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_myth
        @myth = Myth.find(params[:myth_id])