receipts-backend/app/controllers/myths_controller.rb

    def index
        @myths = Myth.all
---
SELECT "myths".* FROM "myths"

    def create
        @myth = Myth.new(myth_params)
        if @myth.save
---
INSERT INTO "myths" ("false_content", "created_at", "updated_at") VALUES (?, ?, ?)  [["false_content", "Kamala doesn't care about black people"], ["created_at", "2020-09-18 08:19:54.397874"], ["updated_at", "2020-09-18 08:19:54.397874"]]

    def show
        @myth = Myth.find(params[:id])
---
SELECT "myths".* FROM "myths" WHERE "myths"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def destroy
        @myth = Myth.find(params[:id])
        if @myth.destroy
---
SELECT "myths".* FROM "myths" WHERE "myths"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "myths" WHERE "myths"."id" = ?  [["id", 6]]